index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-12 Thu 09:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>FOMC Minutes Released April 6 2022</title>
<meta name="author" content="Matt Brigida, Ph.D." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">FOMC Minutes Released April 6 2022</h1>
<p>
We pull total Fed assets data from the FRED database.  Then, starting with assets as of March 2022, we lower these assets by $95 billion per month for the next two years.  This gives us $6.7 trillion in Fed assets by April 2024.
</p>

<iframe src="./levels_chart.html" width="100%" height="800pt"></iframe>

<p>
A log chart will provide some perspective on the recent increase in Fed assets relative to earlier increases, such as after 2008.
</p>

<iframe src="./log_chart.html" width="100%" height="800pt"></iframe>


<p>
Will the assets reduction cause a stock market decline?  The ratio of fed assets (in billions) to S&amp;P value in 2017 was about 1.8.  Keeping this constant would give us an S&amp;P 500 value of 3751.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2022-05-12 Thu 09:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
